tests/WebformulierenVerwerker/scenario04/CorsaCreateMetaDocumentRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:bct="http://bct.nl">
  <soap:Header/>
  <soap:Body>
    <bct:CreateMetaDocument>
      <bct:ObjectID/>
      <bct:ObjectKind>BIJL</bct:ObjectKind>
      <bct:FieldValues>
        <bct:NameValue>
          <bct:Name>poststuk.dat_afh_str</bct:Name>
          <bct:Value>17/12/2001</bct:Value>
        </bct:NameValue>
        <bct:NameValue>
          <bct:Name>poststuk.onderwerp</bct:Name>
          <bct:Value/>
        </bct:NameValue>
        <bct:NameValue>
          <bct:Name>poststuk.inhoud1</bct:Name>
          <bct:Value/>
        </bct:NameValue>
        <bct:NameValue>
          <bct:Name>poststuk.v_plaats_id</bct:Name>
          <bct:Value/>
        </bct:NameValue>
        <bct:NameValue>
          <bct:Name>poststuk.reg_datum</bct:Name>
          <bct:Value>17/12/2001</bct:Value>
        </bct:NameValue>
        <bct:NameValue>
          <bct:Name>poststuk.dat_poststuk</bct:Name>
          <bct:Value>17/12/2001</bct:Value>
        </bct:NameValue>
        <bct:NameValue>
          <bct:Name>poststuk.kenmerk</bct:Name>
          <bct:Value/>
        </bct:NameValue>
        <bct:NameValue>
          <bct:Name>obj_vert.vertrouw_id</bct:Name>
          <bct:Value/>
        </bct:NameValue>
      </bct:FieldValues>
      <bct:ReferenceValues>
        <bct:NameValue>
          <bct:Name>ontvdat</bct:Name>
          <bct:Value>17/12/2001</bct:Value>
        </bct:NameValue>
        <bct:NameValue>
          <bct:Name>kanaal</bct:Name>
          <bct:Value>Internet</bct:Value>
        </bct:NameValue>
      </bct:ReferenceValues>
      <bct:DuplicateID/>
      <bct:DSPTemplateID/>
    </bct:CreateMetaDocument>
  </soap:Body>
</soap:Envelope>